#include<stdio.h>
int main()
{
	//3자리 글자이므로 최소 길이 4
	//끝에 NULL이 들어가야 하므로...
	int n1; //저수로 다이렉트로 입력받음
	char num2[4];
	//char num1[4], num2[4];
	printf("두 수 입력\n");
	scanf("%d %s", &n1, num2); //num2만 문자열로서 입력받음
	// 
	// 
	//printf("첫 번째 수 입력\n");
	//gets(num1);
	//printf("두 번째 수 입력\n");
	//gets(num2);
	//472*5, 472*8, 472*3, 472*385
	//int n1 = ((num1[0] - '0') * 100) + ((num1[1] - '0') * 10) + (num1[2] - '0');
	int n2 = ((num2[0] - '0') * 100) + ((num2[1] - '0') * 10) + (num2[2] - '0');

	//472*'5' => '5'는 정수 5랑 다르다!
	//'5'를 5로 만들어야 함
	//"385"
	//"385"[2] = '5'
	//"385"[1] = '8'
	//"385"[0] = '3'

	printf("%d\n", n1 * (num2[2] - '0'));
	printf("%d\n", n1 * (num2[1] - '0'));
	printf("%d\n", n1 * (num2[0] - '0'));
	printf("%d\n", n1 * n2);

	return 0;
}