
//C 언어 권장 표준
//#include<stdio.h>
//int main()
//{
//	return 0;
//}

//빌드에서 제외했다는 말의 의미
// 실행하지 않겠다는 뜻
#include<stdio.h>
int main()
{
	//Escape(탈출)
	//\ = 역슬래시 혹은 돈 혹은 이스케이프 문자라고 불리움
	//폰트에 따라서 역슬래시 혹은 돈 모양으로 나옴

	//Ins 키를 잘못 누르셨다면 한 번 더 누르시면 됨

	printf("안녕 내 이름은 '이동준'이야\n");
	printf("동해 물과 백두산이 마르고 닳도록\n");
	printf("하느님이 보우하사 우리나라 만세.\n");
	//alt + shift + 위 아래 키 : 여러 군데 선택
	//alt + ctrl + 마우스 클릭 : 여러 군데 선택

	//주석 단축키 : ctrl + k,c
	//주석 해제 단축키 : ctrl + k,u
	printf("무궁화 삼천리 화려 강산\n");
	printf("대한 사람, 대한으로 길이 보전하세.\n");
	printf("남산 위에 저 소나무, 철갑을 두른 듯\n");
	printf("바람 서리 불변함은 우리 기상일세.\n");
	printf("무궁화 삼천리 화려 강산\n");
	printf("대한 사람, 대한으로 길이 보전하세.\n");
	//큰 따옴표의 경우에는 복사 붙여넣기 그대로 하면
	//“ 이거랑 " 이거랑 컴퓨터가 다르게 인식할 수 있음
	//그래서 큰따옴표나 따옴표 등 일부 문자는 내가 다시
	//써줘야 할 수도 있음
	//printf(“찬미가”);
	//printf("찬미가");
	return 0;
}